let allComments = [
  {
    id: 1,
    nameUser: "صدرا رحمتی",
    date: "25/6/02",
    Comment:
      "بهترین و درجه یک. خیلی کمک زیادی میکنن و پشتیبانی عالی دارند حتما پیشنهاد میکنم براتون",
  },
  {
    id: 2,
    nameUser: "فاطمه خاتونی",
    date: "12/6/02",
    Comment:
      "پشتیبانی خیلی خوبی دارند و برنامه ریزی که نگم خیلی خوبه گزارشات هم مرتبا چک میشه من واقعا راضیم",
  },
  {
    id: 3,
    nameUser: "مبینا فدایی",
    date: "10/4/02",
    Comment:
      "فقط میتونم بگم دستتون درد نکنه بابت زحماتی که کشیدید من بسیار لذت بردم از کار شما ممنون ازتون",
  },
  {
    id: 4,
    nameUser: "ماهان جهانی",
    date: "8/4/02",
    Comment:
      "خیلی خوشحالم که شاگرد شما بودم من با برنامه های شما به رتبه دلخواهم دست پیدا کردم وافعا ممنون",
  },
  {
    id: 5,
    nameUser: "آتنا رضا زاده",
    date: "22/3/02",
    Comment:
      "خیلی تویه درسم ضعیف بودم من اصلا فکرشم نمیکردم یک روزی این رتبه رو بدست بیارم کاری که با شما تونستم انجام بدم ممنون بابت زحماتتون",
  },
  {
    id: 6,
    nameUser: "امیرحسین کریمی",
    date: "21/3/02",
    Comment:
      "از هر لحاظی عالین هم در تحصیلات هم در انتخاب رشته انتخاب اول و آخر من همین مشاوره هست. مرسی از همتون",
  },
  {
    id: 7,
    nameUser: "اسرا حبیبی",
    date: "3/3/02",
    Comment:
      "بهترین و درجه یک اند و پشتیبانی بسیار خوبی دارند من خیلی راضیم و خوشحالم که شمارو انتخاب کردم با تشکر ازتون",
  },
];

let listComments = document.querySelector(".list-comments");

function comments(comment) {
  listComments.innerHTML = "";
  let card;
  comment.forEach(function (user) {
    card = document.createElement("div");
    card.className = "card";
    card.innerHTML = `
        <div class="stars">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            fill="currentColor"
            class="star"
          >
            <path
              d="M9.049 2.927c.3-.921 1.603-.921 1.902 0l1.07 3.292a1 1 0 00.95.69h3.462c.969 0 1.371 1.24.588 1.81l-2.8 2.034a1 1 0 00-.364 1.118l1.07 3.292c.3.921-.755 1.688-1.54 1.118l-2.8-2.034a1 1 0 00-1.175 0l-2.8 2.034c-.784.57-1.838-.197-1.539-1.118l1.07-3.292a1 1 0 00-.364-1.118L2.98 8.72c-.783-.57-.38-1.81.588-1.81h3.461a1 1 0 00.951-.69l1.07-3.292z"
            ></path>
          </svg>
        
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            fill="currentColor"
            class="star"
          >
            <path
              d="M9.049 2.927c.3-.921 1.603-.921 1.902 0l1.07 3.292a1 1 0 00.95.69h3.462c.969 0 1.371 1.24.588 1.81l-2.8 2.034a1 1 0 00-.364 1.118l1.07 3.292c.3.921-.755 1.688-1.54 1.118l-2.8-2.034a1 1 0 00-1.175 0l-2.8 2.034c-.784.57-1.838-.197-1.539-1.118l1.07-3.292a1 1 0 00-.364-1.118L2.98 8.72c-.783-.57-.38-1.81.588-1.81h3.461a1 1 0 00.951-.69l1.07-3.292z"
            ></path>
          </svg>
        
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            fill="currentColor"
            class="star"
          >
            <path
              d="M9.049 2.927c.3-.921 1.603-.921 1.902 0l1.07 3.292a1 1 0 00.95.69h3.462c.969 0 1.371 1.24.588 1.81l-2.8 2.034a1 1 0 00-.364 1.118l1.07 3.292c.3.921-.755 1.688-1.54 1.118l-2.8-2.034a1 1 0 00-1.175 0l-2.8 2.034c-.784.57-1.838-.197-1.539-1.118l1.07-3.292a1 1 0 00-.364-1.118L2.98 8.72c-.783-.57-.38-1.81.588-1.81h3.461a1 1 0 00.951-.69l1.07-3.292z"
            ></path>
          </svg>
        
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            fill="currentColor"
            class="star"
          >
            <path
              d="M9.049 2.927c.3-.921 1.603-.921 1.902 0l1.07 3.292a1 1 0 00.95.69h3.462c.969 0 1.371 1.24.588 1.81l-2.8 2.034a1 1 0 00-.364 1.118l1.07 3.292c.3.921-.755 1.688-1.54 1.118l-2.8-2.034a1 1 0 00-1.175 0l-2.8 2.034c-.784.57-1.838-.197-1.539-1.118l1.07-3.292a1 1 0 00-.364-1.118L2.98 8.72c-.783-.57-.38-1.81.588-1.81h3.461a1 1 0 00.951-.69l1.07-3.292z"
            ></path>
          </svg>
        
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 20 20"
            fill="currentColor"
            class="star"
          >
            <path
              d="M9.049 2.927c.3-.921 1.603-.921 1.902 0l1.07 3.292a1 1 0 00.95.69h3.462c.969 0 1.371 1.24.588 1.81l-2.8 2.034a1 1 0 00-.364 1.118l1.07 3.292c.3.921-.755 1.688-1.54 1.118l-2.8-2.034a1 1 0 00-1.175 0l-2.8 2.034c-.784.57-1.838-.197-1.539-1.118l1.07-3.292a1 1 0 00-.364-1.118L2.98 8.72c-.783-.57-.38-1.81.588-1.81h3.461a1 1 0 00.951-.69l1.07-3.292z"
            ></path>
          </svg>
        </div>
        
        <div class="infos">
          <p class="date-time">${user.date}</p>
          <p class="description">
          ${user.Comment}
          </p>
        </div>
        
        <div class="author">— ${user.nameUser}</div>
        `;
    listComments.append(card);
  });
}

comments(allComments);
